In [66]:
#pandas ? Day32-33
#veri analizi ve manipülasyonu için kullanılan popüler bir Python kütüphanesidir.
!pip install pandas

Requirement already satisfied: pandas in c:\users\mehmet can\appdata\roaming\python\python311\site-packages (3.0.0)
Requirement already satisfied: numpy>=1.26.0 in c:\users\mehmet can\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mehmet can\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: tzdata in c:\users\mehmet can\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\mehmet can\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip available: 22.3.1 -> 26.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
import pandas as pd

In [6]:
import numpy as np #genelde pandas ile birlikte kullanılır o yüzden import edelim

In [ ]:
#seriler nelerdir ?
#pd.Series() fonksiyonu ile oluşturulan tek boyutlu etiketli dizilerdir
#amaç serilerde de dataframelerde de veriyi işlenebilecek hale getirmektir
#seriler bir tık daha kolay ama genelde dataframe kullanılır

#bir sözlüğüm olsun bu veritabanı veya internetten gelen bir veri de olabilir
my_dict= {"James" :50, "Alice": 60, "Bob": 70,"Merry":80}

In [9]:
#pd nokta dersin yine pandasın özelliklerine erişmek için 
pd.Series(my_dict)
#ne yaptı seri yaptı yani excel tablosu gibi verdi

James    50
Alice    60
Bob      70
Merry    80
dtype: int64

In [12]:
#series örnekleri
#normal bir numpy dizisi yapalım onu series yapalım
array_ex=np.arange(0,8,2)
array_ex

array([0, 2, 4, 6])

In [13]:
#numpy dizimizi yaptık şimdi seriese çevirelim
pd.Series(array_ex)
#tek değişken olduğu için indexler otomatik atandı 0 dan başlayarak

0    0
1    2
2    4
3    6
dtype: int32

In [14]:
name_list=["Ali","Veli","Ayşe","Fatma"]
nump_array=np.array([10,20,30,40])

pd.Series(data=nump_array,index=name_list)#series içime kim data kim index numarası olacak verebilirsin
#bir tane normal liste var bir tane numpy dizisi var ama pandas ikisini birleştirebiliyor

my_series=pd.Series(data=nump_array,index=name_list)

In [15]:
my_series

Ali      10
Veli     20
Ayşe     30
Fatma    40
dtype: int32

In [16]:
type(my_series)

pandas.Series

In [20]:
my_series["Ali"] #indexe göre erişim yapabiliriz

10

In [21]:
my_series["Ali"]= 99 #değer ataması da yapabiliriz

In [24]:
#direkt pandas üzerinden seri oluşturalım data ve indexi verip
quiz_results=pd.Series(data=[90,85,88,92],index=["Ali","Fatma","Ayşe","Burak"])
quiz_results

Ali      90
Fatma    85
Ayşe     88
Burak    92
dtype: int64

In [25]:
quiz2_results=pd.Series(data=[100,90,45,32],index=["Ali","Fatma","Ayşe","Burak"])

In [26]:
quiz2_results

Ali      100
Fatma     90
Ayşe      45
Burak     32
dtype: int64

In [ ]:
#iki series toplama işlemi yapalım
quiz_results + quiz2_results
#tabi datalar uyuşuyor isim olarak yoksa farklı sonuçlar alırız

Ali      190
Fatma    175
Ayşe     133
Burak    124
dtype: int64

In [48]:
#şimdi pandasın ilk yüzü series baktık artık asıl önemli olan dataframe kısmına geçelim
#DataFrame nedir ?
#dataframe denilen yapı birden fazla seriesin bir araya gelmesiyle oluşan iki boyutlu etiketli veri yapısıdır

In [31]:
my_data=np.array([[10,20,30],[40,50,60],[70,80,90],[100,110,120]])
#liste içinde liste şeklinde yaptık ki tam matrix gibi olsun

In [32]:
my_data

array([[ 10,  20,  30],
       [ 40,  50,  60],
       [ 70,  80,  90],
       [100, 110, 120]])

In [33]:
my_data.shape

(4, 3)

In [34]:
#normal 2 tane liste oluşturalım sonra hepsini tek tablo içinde toplayalım
my_rows=["James","Lars","Kirk","Rob"]
my_columns=["Jan","Feb","Mar"]

In [35]:
#dataframe nasıl oluşturulur ?
my_dataframe=pd.DataFrame(my_data)

In [37]:
my_dataframe

     0    1    2
0   10   20   30
1   40   50   60
2   70   80   90
3  100  110  120

In [38]:
#gördün bak dataframe yapısı series olan yapıya benzer ama tablo yapısına benzetir

In [39]:
type(my_dataframe)

pandas.DataFrame

In [40]:
my_dataframe[0]

0     10
1     40
2     70
3    100
Name: 0, dtype: int32

In [ ]:
new_data_frame=pd.DataFrame(data=my_data,index=my_rows,columns=my_columns)
#yeni bir dataframe oluştur dedik
#içine ne olacağını verdik datamızı
#index olarak şunu al dedik satır yani
#columns olarak şunu al dedik sütun yani

In [50]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    40   50   60
Kirk    70   80   90
Rob    100  110  120

In [45]:
new_data_frame["Feb"]

James     20
Lars      50
Kirk      80
Rob      110
Name: Feb, dtype: int32

In [46]:
type(new_data_frame["Feb"])

pandas.Series

In [47]:
#işte dataframe dediğimiz yapı serilerin biraraya geldiği yapı zaten

In [51]:
#mesela alalım şubattaki şeyleri ortalaması lazım olacak belki
feb_series=new_data_frame["Feb"]

In [53]:
feb_series.mean()

65.0

In [54]:
feb_series.max()

110

In [58]:
#loc ile dataframenin satırlarını da getirebilirsin
new_data_frame.loc["Lars"]
#hep sütunları getirdik dataframeismi.["Sütunismi"] ile

Jan    40
Feb    50
Mar    60
Name: Lars, dtype: int32

In [60]:
#mesela robun ortalama maaşı
new_data_frame.loc["Rob"].mean()

110.0

In [ ]:
#ekleyelim sütun sütun ekleme dataframe ismi yanına [] içinde sütun adını yazarsak yeni sütun ekler
new_data_frame["Apr"]= new_data_frame["Jan"] *2

In [62]:
new_data_frame

       Jan  Feb  Mar  Apr
James   10   20   30   20
Lars    40   50   60   80
Kirk    70   80   90  140
Rob    100  110  120  200

In [63]:
new_data_frame.drop("Rob",axis=0)#axis 0 demek satır demek
new_data_frame.drop("Apr",axis=1)#axis 1 demek sütun demek

       Jan  Feb  Mar
James   10   20   30
Lars    40   50   60
Kirk    70   80   90
Rob    100  110  120

In [65]:
new_data_frame#tablonun orijinali aynı kalır 
#eğer orijinali değiştirmek istiyorsan inplace=True parametresini kullanman lazım
#inplace=True dersek axis bilgisinin yanında olur

       Jan  Feb  Mar  Apr
James   10   20   30   20
Lars    40   50   60   80
Kirk    70   80   90  140
Rob    100  110  120  200

In [67]:
new_data_frame.drop("Apr",axis=1,inplace=True)

In [68]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    40   50   60
Kirk    70   80   90
Rob    100  110  120

In [69]:
boolean_frame = new_data_frame >50

In [70]:
boolean_frame

         Jan    Feb    Mar
James  False  False  False
Lars   False  False   True
Kirk    True   True   True
Rob     True   True   True

In [ ]:
#illaki bir değişkene atamaya gerek yok new_data_frame[new_data_frame >50] yazarsak bize 50 den büyük olanları verir ama diğerleri NaN olur
new_data_frame[new_data_frame >50]

         Jan    Feb    Mar
James    NaN    NaN    NaN
Lars     NaN    NaN   60.0
Kirk    70.0   80.0   90.0
Rob    100.0  110.0  120.0

In [72]:
#sadecem mart ayında 50 den büyük olanları görmek istiyorum
new_data_frame[new_data_frame["Mar"] >50]

      Jan  Feb  Mar
Lars   40   50   60
Kirk   70   80   90
Rob   100  110  120

In [73]:
#DataFrame operations

In [74]:
#eksik verilerimiz olabilir neler yaparız ?

In [75]:
my_dictionary={"James": [40,30,np.nan], "Alice": [60, np.nan, 70], "Bob": [70,80,90],"Merry":[80,90,100]}

In [77]:
my_data_frame=pd.DataFrame(my_dictionary)#sözlüğümüzü aldık dataframe yaptık yani tablo haline getirdik

In [78]:
my_data_frame

   James  Alice  Bob  Merry
0   40.0   60.0   70     80
1   30.0    NaN   80     90
2    NaN   70.0   90    100

In [80]:
my_data_frame.dropna()#içinde nan yani boş olan satırları atar
#nan sütunları silmek istersen axis=1 parametresini verirsin içine

   James  Alice  Bob  Merry
0   40.0   60.0   70     80

In [82]:
my_data_frame.dropna(axis=1,thresh=3)#kaldır diyoruz
#neyi kaldır axis 1 verdik sütunu kaldıracak thresh 3 demek en az 3 tane veri olan sütunları tut gerisini at anlamına gelir

   Bob  Merry
0   70     80
1   80     90
2   90    100

In [83]:
#groupby görelim gruplandırma yapacağız

In [84]:
salary_dict={"Programming Language":["Python","Java","Python","C++","Java","C++","Python"],"Name":["Ali","Veli","Ayşe","Fatma","Can","Deniz","Ece"],"Salary":[6000,5500,7000,6500,5200,7200,7100]}

In [85]:
salary_frame=pd.DataFrame(salary_dict)

In [86]:
salary_frame

  Programming Language   Name  Salary
0               Python    Ali    6000
1                 Java   Veli    5500
2               Python   Ayşe    7000
3                  C++  Fatma    6500
4                 Java    Can    5200
5                  C++  Deniz    7200
6               Python    Ece    7100

In [88]:
group_object=salary_frame.groupby("Programming Language")
#programlama diline göre gruplandır

In [95]:
#group_object. yap . dan sonra fonskiyonlar gelir
group_object.count()

                      Name  Salary
Programming Language
C++                      2       2
Java                     2       2
Python                   3       3

In [ ]:
group_object.describe()#özet istatistik bilgileri verir

                     Salary                                              \
                      count    mean         std     min     25%     50%
Programming Language
C++                     2.0  6850.0  494.974747  6500.0  6675.0  6850.0
Java                    2.0  5350.0  212.132034  5200.0  5275.0  5350.0
Python                  3.0  6700.0  608.276253  6000.0  6500.0  7000.0


                         75%     max
Programming Language
C++                   7025.0  7200.0
Java                  5425.0  5500.0
Python                7050.0  7100.0